management-api/app/controllers/enderecos_controller.rb

  def index
    @enderecos = Endereco.all
---
SELECT "enderecos".* FROM "enderecos"

    def create
    @endereco = Endereco.new(endereco_params)
    if @endereco.save
---
INSERT INTO "enderecos" ("cep", "cidade", "created_at", "estado", "latitude", "longitude", "numero", "rua", "status", "updated_at", "bairro", "veiculo_id") VALUES ('', 'Campo Grande', '2026-05-14 23:01:42.135654', 'MS', -20.490242, -54.616453, '549', 'Rua Aristóteles', 'pendente', '2026-05-14 23:01:42.135654', 'Vila Progresso', NULL) RETURNING "id"

  def atualizar_status
    puts "====== BATIDA NO ENDPOINT DE STATUS ======"
    puts "PARAMS COMPLETOS: #{params.inspect}"
    puts "=========================================="
    if params[:concluir]
      Endereco.where(veiculo_id: params[:veiculo_id], status: "em rota")
              .update_all(status: "entregue", veiculo_id: nil)

      # 2. Libera o veículo
      Veiculo.find(params[:veiculo_id]).update(status: "disponivel")

      Rotum.where(veiculo_id: params[:veiculo_id]).update_all(status: "concluido")
---
UPDATE "veiculos" SET "status" = 'disponivel', "updated_at" = '2026-05-14 23:37:39.389783' WHERE "veiculos"."id" = 'c59cc479-70e5-49aa-b71c-9084222d5c32'
UPDATE "enderecos" SET "status" = 'em rota', "veiculo_id" = NULL WHERE "enderecos"."id" IN ('3dd5d64d-90a8-4b7a-b4ba-0026a44a5d8b', 'e2feed49-1243-4272-bd8d-84c6077584d6')
SELECT "veiculos".* FROM "veiculos" WHERE "veiculos"."id" = 'c59cc479-70e5-49aa-b71c-9084222d5c32' LIMIT 1
UPDATE "veiculos" SET "status" = 'em rota', "updated_at" = '2026-05-14 23:37:05.325627' WHERE "veiculos"."id" = 'c59cc479-70e5-49aa-b71c-9084222d5c32'