management-api/app/controllers/motoristas_controller.rb

SELECT "motoristas".* FROM "motoristas"
---
  def index
    @motoristas = Motorista.all

INSERT INTO "motoristas" ("cpf", "created_at", "nome", "updated_at") VALUES ('47079640873', '2026-05-14 13:10:28.833050', 'José Paulo', '2026-05-14 13:10:28.833050') RETURNING "id"
---
  def create
    @motorista = Motorista.new(motorista_params)

    if @motorista.save