management-api/app/controllers/veiculos_controller.rb

  def index
    @veiculos = Veiculo.all
---
SELECT "veiculos".* FROM "veiculos"

  def create
    @veiculo = Veiculo.new(veiculo_params)

    if @veiculo.save
---
INSERT INTO "veiculos" ("placa", "capacidade", "modelo", "status", "created_at", "updated_at", "motorista_id") VALUES ('HRH7337', 10, 'Vectra', NULL, '2026-05-13 16:32:39.797814', '2026-05-13 16:32:39.797814', NULL) RETURNING "id"